tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "adoptopenjdk/openjdk"

# primitives
# https://en.wikipedia.org/wiki/List_of_GNU_Core_Utilities_commands
brew "coreutils"
brew "git"
brew "neovim"
brew "zsh"
brew "zsh-completions"
brew "tmux"
brew "gnupg"
brew "gnupg2"
# https://github.com/junegunn/fzf
brew "fzf"
# https://github.com/ggreer/the_silver_searcher
brew "the_silver_searcher"
brew "hub"
brew "tmux"
brew "tree"
brew "wget"
brew "rsync"

# tools
brew "lastpass-cli"
brew "youtube-dl"
brew "ffmpeg"
brew "imagemagic"
brew "mas"
brew "p7zip"
brew "dos2unix"
brew "proxychains-ng"
brew "htop"
brew "neofetch"
brew "openssl@1.1"
brew "readline"
brew "asdf"
brew "boost@1.60", link: true
brew "cmake"
brew "node"
brew "sqlite"
brew "xz"
brew "zlib"

# productivity
brew "axel"
brew "exa"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "hexyl"
brew "xsv"
brew "jq"
brew "hledger"

# dev
brew "ruby"
brew "go"
brew "cmake"
# brew "mysql@5.7"
brew "sqlite"
# brew "postgresql"
brew "youtube-dl"
# brew "heroku"
brew "node"
brew "yarn"
# brew "wrk"

if ENV.key? 'CI_MODE'
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "calibre"
cask "charles"
cask "cyberduck"
cask "dash"
cask "dozer"
cask "day-o"
cask "eudic"
cask "font-fira-code"
cask "font-source-code-pro"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "java"
cask "jd-gui"
cask "karabiner-elements"
cask "keycastr"
cask "licecap"
cask "maccy"
cask "mos"
cask "mpv"
cask "nextcloud"
cask "nitroshare"
cask "visual-studio-code"
cask "syncthing"
cask "shadowsocksx-ng"
cask "neteasemusic"
cask "google-trends"
cask "oversight"
# open broadcaster software
cask "obs"
# note-taking app
cask "obsidian"
# cask "dropbox"
cask "postman"
cask "qmk-toolbox"
cask "upic"
cask "via"
cask "vlc"

mas "WeChat", id: 836500024
mas "Unsplash Wallpapers", id: 1284863847
mas "Microsoft ToDo", id: 1274495053
mas "Microsoft OneNote", id: 784801555
# mas "Bear", id: 1091189122
# mas "Lungo", id: 1263070803
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
end
