tap "buo/cask-upgrade"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"

# primitives
brew "axel"
# https://en.wikipedia.org/wiki/List_of_GNU_Core_Utilities_commands
brew "coreutils"
brew "exa"
brew "git"
brew "neovim"
brew "zsh"
brew "zsh-completions"
brew "tmux"
brew "gnupg"
brew "gnu-sed"
# https://github.com/junegunn/fzf
brew "fzf"
# https://github.com/ggreer/the_silver_searcher
brew "the_silver_searcher"
brew "hub"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "rsync"

# tools
brew "youtube-dl"
brew "ffmpeg"
brew "imagemagick"
brew "mas"
brew "nmap"
brew "p7zip"
brew "dos2unix"
brew "proxychains-ng"
brew "htop"
brew "neofetch"
brew "readline"
brew "cmake"
brew "sqlite"
brew "xz"
brew "zlib"
brew "musicbrainz-picard"
brew "plex"

# productivity
brew "ripgrep"
brew "fd"
# brew "hexyl"
# brew "xsv"
brew "jq"
# brew "hledger"

# dev
# brew "ruby"
# brew "go"
# brew "postgresql"
# brew "heroku"
# brew "node"
# brew "yarn"
# brew "wrk"

if ENV.key? 'CI_MODE'
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "calibre"
cask "charles"
cask "cyberduck"
cask "dash"
cask "dozer"
cask "day-o"
cask "eudic"
cask "font-fira-code"
cask "font-source-code-pro"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "java"
cask "jd-gui"
cask "karabiner-elements"
cask "keycastr"
cask "licecap"
cask "mos"
cask "mpv"
cask "nextcloud"
cask "nitroshare"
cask "visual-studio-code"
cask "syncthing"
cask "neteasemusic"
# open broadcaster software
cask "obs"
# note-taking app
cask "obsidian"
# cask "dropbox"
cask "postman"
# cask "qmk-toolbox"
cask "upic"
cask "via"
cask "vlc"

# Quick look
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

mas "WeChat", id: 836500024
mas "Unsplash Wallpapers", id: 1284863847
mas "Microsoft OneNote", id: 784801555
# mas "Lungo", id: 1263070803
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
end
